{
  "backend/main.mo": "Motoko actor defining dairy management system with types for farmers, milk collections, transactions, inventory, and product sales; provides CRUD operations and rate management with stable storage using Maps.",
  "feature_evidence.json": "Feature evidence report documenting implemented keyboard shortcuts for navigation (Ctrl+1/2/3), dairy tabs (Ctrl+M/B/D/S/C), form submission (Enter), dialog closing (Escape), and tab navigation with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components detailing keyboard shortcuts, accessibility features, form handling, navigation patterns, and React Query integration across the dairy management application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'ANMOL DAIRY LIFE', and script reference to main.tsx module.",
  "frontend/src/App.tsx": "Main application component with three-tab navigation (Dairy, Transactions, Settings), global keyboard shortcuts (Ctrl+1/2/3, '?'), skip-to-content link, roving tabindex pattern, arrow key navigation, and keyboard shortcuts help dialog.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Component for generating and printing farmer bills based on date range, showing milk collection transactions, deductions, and net payable amounts with print functionality.",
  "frontend/src/components/dairy/CashModule.tsx": "Component for recording cash payments to and receipts from farmers, with transaction type selection and comment support.",
  "frontend/src/components/dairy/DairySection.tsx": "Main dairy module container with tabbed navigation between milk collection, bill generation, data reports, sell, and cash modules, including keyboard shortcuts.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session (morning/evening), displaying collections in a table with totals and averages.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for recording milk collection entries with farmer lookup, weight/fat/SNF input, amount calculation preview, and session-based entry management.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales with optional customer lookup, product selection from inventory, quantity/price inputs, and print bill functionality. Handles sale submission with validation and toast notifications.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening), showing farmer details, milk type, measurements (weight, FAT, SNF), and calculated amounts.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized by category: global navigation, dairy section, forms/dialogs, search/lists, print/export, and tab navigation.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Manages farmer records with search functionality, add/edit dialogs for farmer details (name, phone, milk type, customer ID), and displays farmer list with balance information. Includes keyboard shortcuts (Ctrl+F for search).",
  "frontend/src/components/settings/InventoryManagement.tsx": "Handles inventory operations with dialogs for adding new products and updating stock quantities. Displays inventory table and supports keyboard navigation with Enter key submission.",
  "frontend/src/components/settings/RateSettings.tsx": "Allows updating global milk rates for VLC (cow) and Thekadari (buffalo) milk types. Shows current rates and provides input fields with save buttons for each rate type.",
  "frontend/src/components/settings/SettingsSection.tsx": "Tabbed interface container for settings with three tabs (Farmers, Rate Settings, Inventory) that supports keyboard navigation using arrow keys and Enter/Space for tab switching.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays a farmer's transaction history with balance, supports PDF generation and SMS sharing of transaction reports, and includes keyboard shortcuts (Ctrl+P for PDF).",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Main transactions view with searchable farmer list (Ctrl+F to focus search), arrow key navigation, and click-through to individual farmer transaction history.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating queries when identity changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Custom hook providing arrow key navigation (up/down) and Enter key selection for list items with focus management.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Implements Ctrl+M/B/D/S/C keyboard shortcuts for navigating to dairy-specific sections (milk collection, bill, data, sell, cash).",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Provides global keyboard shortcuts: Ctrl+1/2/3 for main navigation (dairy, transactions, settings) and '?' for help dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including farmers, rates, collections, transactions, inventory, and product sales with mutations and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, includes accessibility focus indicators, screen-reader utilities, and comprehensive print styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/utils/calculations.ts": "Contains calculation functions for milk pricing including VLC amount calculation, Thekadari calculations (less/add, net milk, amount), and a utility to determine current session (morning/evening) based on time.",
  "frontend/src/utils/formatters.ts": "Provides formatting utilities for displaying less/add values with +/- signs, currency in rupees, and timestamps in various formats (date, datetime, time) using Indian locale.",
  "frontend/src/utils/pdfGenerator.ts": "Generates printable HTML content for transaction history PDFs including farmer details, current balance, and transaction records with styled tables and formatting.",
  "frontend/src/utils/smsHelper.ts": "Provides utilities to create SMS URIs and open native SMS apps with pre-filled phone numbers and messages, handling proper encoding and phone number cleaning.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and custom design tokens for the application.",
  "project_state.json": "Project metadata file tracking implemented features related to keyboard shortcuts, navigation, form submission, accessibility focus indicators, and keyboard-driven interactions across the dairy management application."
}