{
  "backend/main.mo": "Main Motoko actor defining dairy management data types (Farmer, CollectionEntry, Transaction, ProductSale, InventoryEntry) and providing CRUD operations with pagination support for farmers, milk collections, transactions, inventory, and product sales.",
  "feature_evidence.json": "Feature evidence report documenting six implemented requirements for a read-only farmer portal route displaying farmer details, balance, and transaction history without edit/navigation controls, with mobile-friendly styling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including main App with routing, React Query hooks, utility functions, dairy management forms with keyboard navigation, transaction views, settings panels, and PDF generation capabilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, sidebars, and chart colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title \"ANMOL DAIRY LIFE\", and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component using TanStack Router with three routes: main app with tabbed navigation (Dairy/Transactions/Settings), PDF-only view, and read-only farmer portal view, plus global keyboard shortcuts and accessibility features.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Component for generating and printing farmer bills for a date range, displaying milk collection entries with totals, weight, and calculated amounts. Includes keyboard shortcuts (Ctrl+P) for printing and supports filtering collections by date.",
  "frontend/src/components/dairy/CashModule.tsx": "Component for recording cash transactions (payments and receipts) for farmers. Displays farmer details and current balance, with keyboard navigation support and Enter key submission.",
  "frontend/src/components/dairy/DairySection.tsx": "Main dairy module container with tabbed navigation between Milk Collection, Bill, Data Reports, Sell, and Cash sections. Implements keyboard shortcuts for tab navigation and section switching.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session (morning/evening/both). Displays paginated table with totals, averages, and supports keyboard navigation for pagination.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for recording milk collection entries with customer ID, weight, fat, and SNF inputs. Includes preview dialog with calculated amounts and keyboard navigation between fields with Enter key progression.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales with optional customer ID, product selection from inventory, quantity/price inputs, and optional bill printing functionality.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening) with farmer details, milk type, weight, FAT/SNF percentages, and calculated amounts.",
  "frontend/src/components/farmer-portal/FarmerPortalView.tsx": "Farmer-facing portal view showing farmer details, current balance, and paginated transaction history with 20 items per page.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized by category (Global Navigation, Dairy Section, Forms, Search, Print, Tab Navigation) with visual key representations.",
  "frontend/src/components/pdf/PDFView.tsx": "PDF-printable view of farmer transaction history that auto-triggers the print dialog once data is loaded.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Admin interface for adding, editing, and searching farmers with support for updating customer ID, name, phone, and milk type.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Admin interface for managing product inventory with dialogs to add new products and update stock quantities.",
  "frontend/src/components/settings/RateSettings.tsx": "React component for managing VLC (cow) and Thekadari (buffalo) milk rates with input fields, save buttons, and keyboard shortcuts (Enter to save).",
  "frontend/src/components/settings/SettingsSection.tsx": "Tabbed settings interface with three tabs (Farmers, Rate Settings, Inventory) supporting keyboard navigation (Arrow keys, Enter, Space).",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays transaction history for a specific farmer with pagination (arrow key navigation), balance display, and PDF generation functionality.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Farmer list view with search (Ctrl+F), arrow key navigation, and drill-down to individual farmer transaction history.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Custom hook providing arrow key navigation (up/down) and Enter key selection for list items with focus management.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Keyboard shortcut hook for dairy section navigation using Ctrl+M/B/D/S/C for milk collection, bill, data, sell, and cash operations.",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Global keyboard shortcuts hook for main navigation (Ctrl+1/2/3 for sections) and help dialog (? key).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including farmers, rates, collections, inventory, transactions, and product sales with caching and pagination support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, accessibility focus styles, and print-specific styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/calculations.ts": "Contains calculation functions for VLC and Thekadari milk pricing based on quantity, fat, SNF, and rates, plus session determination logic.",
  "frontend/src/utils/formatters.ts": "Provides formatting utilities for currency, dates, times, and less/add values with Indian locale support.",
  "frontend/src/utils/pdfGenerator.ts": "Handles PDF generation by opening a dedicated route in a new window for farmer transaction reports.",
  "frontend/src/utils/smsHelper.ts": "Creates SMS URIs and opens native SMS apps with pre-filled phone numbers and messages for mobile devices.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom OKLCH color system, container settings, typography plugin, and animation utilities.",
  "project_state.json": "Project metadata tracking existing features for farmer portal read-only views and a pending feature request for bill/transaction viewing without edit permissions."
}