{
  "backend/main.mo": "Motoko actor defining the dairy management system backend with types and functions for farmers, milk collections, transactions, inventory, product sales, and rate management. Includes CRUD operations for farmers, collection entries, transactions, inventory items, and sales with Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting three keyboard navigation features in MilkCollectionForm.tsx: Enter key navigation from farmer ID to quantity field, quantity to fat field, and fat field triggering save action.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files covering App.tsx, hooks, utilities, and all component files with details on keyboard shortcuts, navigation patterns, form handling, and accessibility features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including background, foreground, primary, secondary, muted, accent, destructive, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'ANMOL DAIRY LIFE', and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Main application component with three-tab navigation (Dairy, Transactions, Settings), global keyboard shortcuts (Ctrl+1/2/3, '?'), skip-to-content link, arrow key tab navigation, and hero background image with backdrop blur.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Component for generating and printing farmer bills based on date range, displaying milk collection transactions, deductions, and net payable amounts with keyboard shortcuts for printing.",
  "frontend/src/components/dairy/CashModule.tsx": "Component for recording cash payments to and receipts from farmers, with transaction type selection and optional comments, supporting keyboard navigation.",
  "frontend/src/components/dairy/DairySection.tsx": "Main dairy module container with tabbed navigation between Milk Collection, Bill, Data Reports, Sell, and Cash sections, implementing keyboard shortcuts for tab switching.",
  "frontend/src/components/dairy/DataReports.tsx": "Component displaying filtered milk collection reports by date and session (morning/evening/both), showing detailed collection entries with totals and averages in a table format.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for recording milk collection entries with farmer lookup, weight/fat/SNF inputs, preview dialog for calculated amounts, and keyboard navigation support for quick data entry.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales with optional customer ID lookup, product selection from inventory, quantity/price inputs, and optional bill printing functionality.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening) with farmer details, milk type, measurements, and calculated amounts.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized into sections: Global Navigation, Dairy Section, Forms & Dialogs, Search & Lists, Print & Export, and Tab Navigation.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Manages farmer records with search functionality, add/edit dialogs for farmer details (name, phone, milk type, customer ID), and displays farmer balances.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Handles inventory operations including adding new products, updating stock quantities, and displaying current inventory in a table format.",
  "frontend/src/components/settings/RateSettings.tsx": "Provides interface to configure and update global milk rates for VLC (cow) and Thekadari (buffalo) milk types.",
  "frontend/src/components/settings/SettingsSection.tsx": "Tabbed container component that organizes settings into three sections: Farmers, Rate Settings, and Inventory with keyboard navigation support.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays a farmer's transaction history with balance, supports PDF generation and SMS sharing of transaction reports, and includes keyboard shortcuts (Ctrl+P for PDF).",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Main transactions view with searchable farmer list (Ctrl+F to focus search), arrow key navigation, and drill-down to individual farmer transaction history.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating queries when identity changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Custom hook providing arrow key navigation (up/down) and Enter key selection for list items with focus tracking.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Implements Ctrl+M/B/D/S/C keyboard shortcuts for navigating to dairy sections (milk collection, bill, data, sell, cash) when active.",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Provides global keyboard shortcuts: Ctrl+1/2/3 for main navigation (dairy, transactions, settings) and '?' for help dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including farmers, rates, collections, transactions, inventory, and product sales with mutations and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, accessibility focus styles, and print-specific styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/utils/calculations.ts": "Contains utility functions for milk pricing calculations including VLC and Thekadari methods, computing amounts based on quantity, fat, SNF, and rate, plus session determination logic.",
  "frontend/src/utils/formatters.ts": "Provides formatting utilities for displaying less/add values, currency, dates, times, and calculating totals from numeric arrays.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML-based PDF content for farmer transaction history reports including farmer details, balance, and transaction records with styling.",
  "frontend/src/utils/smsHelper.ts": "Provides utilities to construct SMS URIs and open native SMS applications with pre-filled phone numbers and message content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens.",
  "project_state.json": "Project metadata tracking existing features for Enter key navigation in milk collection form and a pending feature request for the same functionality."
}