{
  "backend/main.mo": "Main Motoko actor defining dairy management system with farmer records, milk collections, transactions, inventory, and product sales. Includes CRUD operations, pagination, rate management, and migration support.",
  "backend/migration.mo": "Migration module that transforms old collection entries without IDs to new collection entries with ID fields during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for adding edit functionality to cash transactions, product sales, and milk collection entries.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including forms, reports, settings, keyboard navigation, and PDF generation features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup, three-tab navigation (Dairy, Transactions, Settings), global keyboard shortcuts, and separate PDF-only route for printing.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Generates and prints bills for farmers showing milk collection entries within a date range, with totals for weight and amount. Supports keyboard shortcuts (Ctrl+P) for printing and includes validation for date ranges and customer data.",
  "frontend/src/components/dairy/CashModule.tsx": "Manages cash transactions (payments and receipts) for farmers, displaying transaction history in a table with edit functionality. Supports keyboard shortcuts (Enter to submit) and validates transaction amounts.",
  "frontend/src/components/dairy/DairySection.tsx": "Main container component for the dairy module with five tabs (Milk Collection, Bill, Data Reports, Sell, Cash). Implements keyboard navigation between tabs using arrow keys and custom shortcuts.",
  "frontend/src/components/dairy/DataReports.tsx": "Displays paginated collection entries filtered by date and session (morning/evening/both) with totals and averages. Includes inline editing functionality for collection entries and calculates aggregate statistics.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form for recording milk collection entries with customer ID, weight, fat, and SNF inputs. Shows a preview dialog before saving and supports keyboard navigation (Enter key) between fields, with automatic focus management.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording and editing product sales with customer selection, inventory management, and optional bill printing functionality.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening) with farmer details, milk metrics, and calculated amounts.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized by category (navigation, forms, search, print, tabs).",
  "frontend/src/components/pdf/PDFView.tsx": "Renders a printable PDF view of a farmer's transaction history with balance and auto-triggers print dialog when data loads.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Manages farmer records with search, add, and edit functionality including customer ID, name, phone, and milk type fields.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Handles inventory product management with add new product and update stock quantity dialogs and table display.",
  "frontend/src/components/settings/RateSettings.tsx": "Provides UI for updating VLC (cow) and Thekadari (buffalo) milk rates with current rate display and save functionality.",
  "frontend/src/components/settings/SettingsSection.tsx": "A tabbed settings component with three sections (Farmers, Rate Settings, Inventory) that supports keyboard navigation with arrow keys and Enter/Space for tab selection.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays a farmer's transaction history with pagination, balance display, and PDF generation functionality. Supports keyboard navigation (arrow keys) for page navigation.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "A searchable farmer list component with Ctrl+F search focus shortcut and arrow key navigation for selecting farmers to view their transaction history.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state, automatically invalidating and refetching queries when the actor changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Custom hook providing arrow key navigation (up/down) and Enter key selection for list items, with automatic focus index management and reset on item count changes.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Custom hook implementing Ctrl/Cmd keyboard shortcuts for dairy-specific navigation (M for milk collection, B for bill, D for data, S for sell, C for cash).",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Custom hook implementing global keyboard shortcuts: '?' for help dialog and Ctrl+1/2/3 for navigating to Dairy, Transactions, and Settings sections.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for managing farmers, rates, collections, transactions, inventory, and product sales data with caching, pagination, and mutation support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes, accessibility focus styles, and print-specific bill formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/calculations.ts": "Utility functions for calculating milk amounts based on VLC or Thekadari types, including fat/SNF-based pricing and session determination.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for currency, dates, times, and less/add values with Indian locale support.",
  "frontend/src/utils/pdfGenerator.ts": "Helper functions to generate transaction PDFs by opening a dedicated PDF route in a new window.",
  "frontend/src/utils/smsHelper.ts": "Utility functions to construct SMS URIs and open the device's native SMS app with pre-filled phone numbers and messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata tracking dairy management app features, including pending edit functionality for Cash, Sell, and Milk Collection entries."
}