{
  "backend/main.mo": "Main actor implementing dairy management system with farmer registration, milk collection tracking, transactions, inventory, product sales, and global VLC/Thekadari rate management with migration support.",
  "backend/migration.mo": "Migration module that transforms old farmer records (with individual rates) to new farmer records (without rates) and adds global vlcRate and thekadariRate variables to the actor state.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: global rate settings, PDF bill generation, print functionality, SMS transaction summaries, farmer edit functionality, and keyboard navigation with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App navigation, hooks for backend queries, utility functions, dairy operations (collection, billing, reports, sales, cash), transaction management, and settings (farmers, rates, inventory) with keyboard accessibility.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes, custom CSS variables for dairy-themed UI, and print media queries for bill formatting.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'ANMOL DAIRY LIFE', and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component with three-tab navigation (Dairy, Transactions, Settings), hero background image, keyboard navigation with arrow keys, and ARIA attributes for accessibility.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Component for generating milk collection bills for farmers within a date range, with options to generate PDF, share, and print the bill.",
  "frontend/src/components/dairy/CashModule.tsx": "Component for recording cash transactions (pay/receive) with farmers, including amount, transaction type, and optional comments.",
  "frontend/src/components/dairy/DairySection.tsx": "Main tabbed container component that organizes and displays five dairy management modules: Milk Collection, Bill, Data Reports, Sell, and Cash.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session, displaying a table with totals for quantity, fat, net milk, and amount.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for recording milk collection entries with farmer ID, weight, fat, and SNF values, showing a preview dialog before saving and displaying session entries list.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales to farmers or general customers, selecting from inventory with quantity and price inputs, and printing receipts.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening), showing farmer details, milk type, weight, FAT/SNF percentages, and calculated amounts.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Provides farmer CRUD operations with search functionality, allowing users to add new farmers and edit existing farmer details including name, phone, milk type, and customer ID.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Manages inventory products with dialogs for adding new products and updating stock quantities, displaying current inventory in a table format.",
  "frontend/src/components/settings/RateSettings.tsx": "Allows configuration of global milk rates for VLC (cow) and Thekadari (buffalo) milk types with separate input fields and save buttons for each rate.",
  "frontend/src/components/settings/SettingsSection.tsx": "Provides a tabbed interface organizing three settings sections: Farmers, Rate Settings, and Inventory management.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays a farmer's transaction history with current balance, and provides actions to create PDF reports and send SMS summaries of recent transactions.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "React component that displays a searchable list of farmers with their balances, allowing users to select a farmer to view their detailed transaction history. Uses keyboard navigation and accessibility features for farmer selection.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations, including operations for farmers, rates, collections, transactions, inventory, and product sales using the ICP actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, plus print-specific styles for bill formatting on A4 paper.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/calculations.ts": "Utility functions for calculating milk amounts based on VLC or Thekadari milk types, including fat/SNF-based pricing and session determination (morning/evening).",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting numbers, currency (INR), dates, and timestamps for display in the Indian locale.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, animations, and container settings for the UI component library.",
  "project_state.json": "Project state file for ANMOL DAIRY LIFE application tracking architectural decisions, features, and requirements. Documents two billing formulas (VLC for cow milk based on FAT/SNF, Thekadari for buffalo milk quantity-adjusted by FAT), automatic weekly billing cycles, transaction management, inventory system, and SMS/PDF export capabilities across Dairy, Transactions, and Settings sections."
}