{
  "backend/main.mo": "Main Motoko actor defining data types (Farmer, CollectionEntry, Transaction, Product, InventoryEntry, ProductSale) and CRUD operations for dairy management including farmers, milk collections, transactions, inventory, and product sales with rate management for VLC and Thekadari milk types.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of Enter key navigation from Fat to SNF input field in MilkCollectionForm.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing keyboard navigation patterns, Enter key flows, tabIndex management, ARIA attributes, and React Query hooks across dairy, transactions, and settings sections.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'ANMOL DAIRY LIFE', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with three-tab navigation (Dairy, Transactions, Settings), global keyboard shortcuts (Ctrl+1/2/3, '?'), skip-to-content link, roving tabindex pattern, arrow key navigation, and keyboard shortcuts help dialog.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Bill generation interface with customer ID and date range inputs, Ctrl+P keyboard shortcut for PDF generation, proper tabIndex order, and displays collection entries with totals, deductions, and net payable amount.",
  "frontend/src/components/dairy/CashModule.tsx": "React component for recording cash payments and receipts for farmers, with form validation, keyboard navigation support, and transaction mutation handling.",
  "frontend/src/components/dairy/DairySection.tsx": "Main dairy section component with tabbed navigation between five modules (Milk Collection, Bill, Data Reports, Sell, Cash) and keyboard shortcut support.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session, displaying collections in a table with calculated totals and averages.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for recording milk collection entries with customer lookup, weight/fat/SNF inputs, preview dialog, and keyboard navigation between fields.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales to farmers or anonymous customers, with inventory selection, quantity/price inputs, and optional bill printing.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening) with farmer names, milk details, and calculated amounts.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized by category (Global Navigation, Dairy Section, Forms & Dialogs, Search & Lists, Print & Export, Tab Navigation).",
  "frontend/src/components/settings/FarmerManagement.tsx": "Manages farmer CRUD operations with search, add, and edit dialogs. Includes keyboard shortcuts (Ctrl+F for search) and displays farmer balances with milk type selection.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Handles inventory product management with add and update stock dialogs. Displays inventory table and supports keyboard navigation with Enter key submission.",
  "frontend/src/components/settings/RateSettings.tsx": "Configures global milk rates for VLC (cow) and Thekadari (buffalo) milk types. Provides separate inputs and save buttons for each rate with Enter key support.",
  "frontend/src/components/settings/SettingsSection.tsx": "Tabbed interface container for settings with three tabs: Farmers, Rate Settings, and Inventory. Implements keyboard navigation with arrow keys and Enter/Space for tab switching.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays transaction history for a selected farmer with balance and transaction table. Supports PDF generation (Ctrl+P) and SMS sharing with transaction details.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Lists all farmers with search functionality (Ctrl+F) and arrow key navigation. Clicking a farmer shows their transaction history via FarmerTransactionHistory component.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Provides keyboard navigation (arrow keys and Enter) for list items with focus management, automatically handling index wrapping and selection callbacks.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Implements Ctrl/Cmd keyboard shortcuts (M, B, D, S, C) for navigating between dairy-specific sections like milk collection, bill, data, sell, and cash.",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Handles global keyboard shortcuts including '?' for help and Ctrl+1/2/3 for navigating to dairy, transactions, and settings sections.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including farmers, rates, collections, transactions, inventory, and product sales with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color tokens for light/dark themes, focus indicators for accessibility, and print-specific styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/utils/calculations.ts": "Contains milk pricing calculation functions for VLC and Thekadari milk types, including fat/SNF-based formulas and session determination logic.",
  "frontend/src/utils/formatters.ts": "Provides formatting utilities for currency, dates, times, and less/add values with Indian locale formatting.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable PDF document containing farmer details, current balance, and transaction history by creating an HTML container with styled content.",
  "frontend/src/utils/smsHelper.ts": "Provides utility functions to create SMS URIs and open the native SMS app with pre-filled phone number and message content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, animations, and design tokens for the frontend.",
  "project_state.json": "Project metadata tracking architectural notes, features, and a pending feature request (AR-1) to enable Enter key navigation from Fat field to SNF field."
}