{
  "backend/main.mo": "Motoko actor defining the dairy management system's backend with types for farmers, milk collections, transactions, inventory, and product sales, plus functions for CRUD operations on farmers, collections, transactions, rates, inventory, and sales with stable storage using Maps.",
  "feature_evidence.json": "Feature evidence report identifying two high-confidence features: debugging BillGenerator PDF generation to populate all farmer details and collection data, and verifying print styles in index.css for proper bill layout.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx with three-tab navigation, useQueries hooks for backend operations, calculation utilities, and specialized modules for milk collection, billing, transactions, and settings with keyboard accessibility throughout.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and chart colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'ANMOL DAIRY LIFE', and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Main application component with three-tab navigation (Dairy, Transactions, Settings), hero background image, keyboard navigation with arrow keys for tab switching, and ARIA attributes for accessibility.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Bill generation component with farmer selection by customer ID, date range picker, filtered collection display, totals calculation, and PDF generation via browser print dialog with share functionality and formatted bill layout.",
  "frontend/src/components/dairy/CashModule.tsx": "React component for recording cash transactions (pay/receive) with farmers, including farmer lookup, transaction type selection, amount input, and keyboard navigation support.",
  "frontend/src/components/dairy/DairySection.tsx": "Main tabbed navigation component for the dairy module, managing five tabs (Milk Collection, Bill, Data Reports, Sell, Cash) with keyboard navigation support.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session, displaying a table with totals and averages for quantity, fat, and amounts.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for entering milk collection data (weight, fat, SNF) with preview dialog, calculation display, and session-based entry management.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales to farmers, with inventory selection, quantity/price input, total calculation, and print functionality.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening) with calculated amounts and farmer details.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Provides UI for managing farmers with search, add, and edit functionality including name, phone, milk type, and customer ID fields. Displays farmer list with balance information and handles form validation and mutations.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Manages inventory products with add and update stock dialogs, displaying a table of products with quantities. Handles product creation and stock quantity updates with validation.",
  "frontend/src/components/settings/RateSettings.tsx": "Allows configuration of global milk rates for VLC (cow) and Thekadari (buffalo) milk types. Displays current rates and provides separate inputs to update each rate independently.",
  "frontend/src/components/settings/SettingsSection.tsx": "Main settings container with tabbed interface for Farmers, Rate Settings, and Inventory management. Handles keyboard navigation between tabs with arrow keys.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays detailed transaction history for a selected farmer with balance, transaction table, and actions to create PDF or send SMS summary. Shows recent transactions with timestamps and amounts.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Lists all farmers with searchable interface and balance display, allowing selection to view detailed transaction history. Shows color-coded balances (red for negative, green for positive).",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor instance for backend communication, automatically invalidating dependent queries when the actor changes based on identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout with AuthClient, including identity persistence and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including farmers, rates, collections, transactions, inventory, and product sales with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, focus indicators, and print-specific styles for bill formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/utils/calculations.ts": "Contains milk pricing calculation functions for VLC and Thekadari milk types, including amount, net milk, and less/add calculations, plus session determination logic.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting numbers, currency, dates, and times for display in the Indian locale.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH color system, typography, animations, and design tokens for the application theme.",
  "project_state.json": "Project state file for ANMOL DAIRY LIFE application tracking 11 versions with dairy management features including milk collection, billing (VLC/Thekadari formulas), transactions, inventory, and SMS/PDF exports. Documents known issues with keyboard navigation, decimal display in Less/Add fields, and empty PDF generation."
}