{
  "backend/main.mo": "Main Motoko actor defining dairy management data types (Farmer, CollectionEntry, Transaction, ProductSale, InventoryEntry) and backend functions for farmer management, milk collection, transactions, inventory, and sales with pagination support (pageSize=50).",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: pagination for DataReports and FarmerTransactionHistory, lazy loading for bill generation, and React Query caching strategy for frequently accessed data.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing keyboard navigation patterns, pagination implementations, lazy loading strategies, form flows, and accessibility features across the dairy management application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title \"ANMOL DAIRY LIFE\", and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component with three-tab navigation (Dairy, Transactions, Settings), global keyboard shortcuts (Ctrl+1/2/3, '?'), skip-to-content link, arrow key tab navigation, and hero background image.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Component for generating and printing farmer bills for a date range, displaying milk collection entries with totals, weights, and amounts. Supports keyboard shortcuts (Ctrl+P) and includes print-specific styling.",
  "frontend/src/components/dairy/CashModule.tsx": "Component for recording cash transactions (payments and receipts) for farmers, with transaction type selection and optional comments. Supports Enter key submission and arrow key navigation.",
  "frontend/src/components/dairy/DairySection.tsx": "Main dairy module container with tabbed navigation between Milk Collection, Bill, Data Reports, Sell, and Cash sections. Implements keyboard shortcuts and arrow key navigation between tabs.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session (morning/evening/both), displaying paginated tables with totals and averages. Supports arrow key pagination.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form for recording milk collection entries with farmer lookup, weight/fat/SNF inputs, and preview dialog before saving. Implements Enter key navigation between fields and session-based data display.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales with optional customer ID lookup, product selection from inventory, quantity/price inputs, and bill printing functionality. Handles sale submission with validation and toast notifications.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Displays a table of milk collection entries for a specific session (morning/evening), showing farmer details, milk type, weight, FAT/SNF percentages, and calculated amounts. Fetches collections and farmer data to populate the table.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Dialog component displaying comprehensive keyboard shortcuts documentation organized by category (Global Navigation, Dairy Section, Forms & Dialogs, Search & Lists, Print & Export, Tab Navigation).",
  "frontend/src/components/settings/FarmerManagement.tsx": "Manages farmer records with search functionality, add/edit dialogs for farmer details (name, phone, milk type, customer ID), and displays farmer list with balance information. Includes keyboard shortcuts (Ctrl+F for search) and focus management.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Handles inventory operations with dialogs for adding new products and updating stock quantities. Displays inventory table showing product names and current quantities with keyboard navigation support.",
  "frontend/src/components/settings/RateSettings.tsx": "Provides UI for updating VLC (cow) and Thekadari (buffalo) milk rates, displaying current rates and allowing independent updates for each type with validation and Enter key submission.",
  "frontend/src/components/settings/SettingsSection.tsx": "Tab container component that organizes settings into three sections (Farmers, Rate Settings, Inventory) with keyboard navigation support (arrow keys, Enter/Space) and proper ARIA attributes for accessibility.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays paginated transaction history for a specific farmer with PDF generation and SMS sharing capabilities. Includes keyboard navigation for pagination and fetches all transactions when generating PDFs.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Main transactions view with searchable farmer list and arrow key navigation. Allows selecting a farmer to view their transaction history with Ctrl+F search shortcut.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useArrowKeyNavigation.ts": "Custom hook providing arrow key navigation (up/down) and Enter key selection for list items with focus tracking.",
  "frontend/src/hooks/useDairyKeyboardShortcuts.ts": "Implements Ctrl/Cmd keyboard shortcuts for dairy section navigation (M for milk collection, B for bill, D for data, S for sell, C for cash).",
  "frontend/src/hooks/useGlobalKeyboardShortcuts.ts": "Provides global keyboard shortcuts for main navigation (Ctrl+1/2/3 for sections) and help dialog (? key).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout state and identity persistence with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including farmers, rates, collections, transactions, inventory, and sales with caching and mutation strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, accessibility focus styles, and print-specific styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/utils/calculations.ts": "Utility functions for milk billing calculations including VLC and Thekadari formulas, amount calculations based on fat/SNF content, and session determination logic.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for displaying currency, dates, times, and less/add values with proper localization for Indian format.",
  "frontend/src/utils/pdfGenerator.ts": "Generates printable HTML transaction history reports for farmers including balance, transaction details, and formatted styling for PDF output.",
  "frontend/src/utils/smsHelper.ts": "Helper functions to construct SMS URIs and open native SMS apps with pre-filled phone numbers and messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with OKLCH colors, typography, animations, and design system tokens for the application.",
  "project_state.json": "Project metadata tracking architectural decisions, known performance issues with large datasets, and pending feature requests for pagination and lazy loading optimizations."
}