{
  "backend/main.mo": "Motoko actor defining the dairy management backend with types and functions for farmers, milk collections, transactions, inventory, and product sales, including CRUD operations and rate management.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features related to generating and printing sell bills with company header, farmer details, and transaction information.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including dairy operations, transactions, settings, and utilities with details on keyboard navigation, ARIA support, and PDF generation capabilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, sidebar, and other design tokens.",
  "frontend/index.html": "HTML entry point for the application with title 'ANMOL DAIRY LIFE' and a root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component with three-tab navigation (Dairy, Transactions, Settings), hero background image, keyboard navigation support, and ARIA attributes for accessibility.",
  "frontend/src/components/dairy/BillGenerator.tsx": "Bill generation component with farmer selection, date range filtering, bill preview with totals and averages, and PDF generation via browser print dialog with share functionality.",
  "frontend/src/components/dairy/CashModule.tsx": "React component for recording cash transactions (pay/receive) with farmers, including farmer lookup, transaction type selection, amount input, and keyboard navigation support.",
  "frontend/src/components/dairy/DairySection.tsx": "Main tabbed container component for the dairy module that manages navigation between five sections: Milk Collection, Bill, Data Reports, Sell, and Cash with keyboard navigation support.",
  "frontend/src/components/dairy/DataReports.tsx": "Component for viewing and filtering milk collection data by date and session (morning/evening/both), displaying collections in a table with calculated totals and averages.",
  "frontend/src/components/dairy/MilkCollectionForm.tsx": "Form component for entering milk collection data (customer ID, weight, fat, SNF) with preview dialog, automatic rate calculation based on milk type, and session-based entry management.",
  "frontend/src/components/dairy/SellModule.tsx": "Component for recording product sales to farmers with inventory selection, automatic total calculation, and integrated bill printing functionality using a hidden print container.",
  "frontend/src/components/dairy/SessionEntriesList.tsx": "Display component that shows a table of all milk collection entries for a specific session (morning/evening) with farmer names, milk details, and calculated amounts.",
  "frontend/src/components/settings/FarmerManagement.tsx": "Provides UI for managing farmers with search, add, and edit functionality. Handles farmer creation with name/phone/milk type and updates including customer ID validation.",
  "frontend/src/components/settings/InventoryManagement.tsx": "Manages inventory products with add and update stock dialogs. Displays product list in a table with quantity tracking and keyboard navigation support.",
  "frontend/src/components/settings/RateSettings.tsx": "Allows updating VLC (cow) and Thekadari (buffalo) milk rates independently. Displays current rates and provides input fields with save buttons for each rate type.",
  "frontend/src/components/settings/SettingsSection.tsx": "Main settings container with tabbed interface for Farmers, Rate Settings, and Inventory. Implements keyboard navigation between tabs with arrow keys.",
  "frontend/src/components/transactions/FarmerTransactionHistory.tsx": "Displays transaction history for a specific farmer with balance and transaction list. Provides PDF generation and SMS sharing functionality with cleanup on unmount.",
  "frontend/src/components/transactions/TransactionsSection.tsx": "Lists all farmers with searchable interface and balance display. Clicking a farmer navigates to their detailed transaction history view.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including farmers, rates, collections, transactions, inventory, and product sales operations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, focus indicators for accessibility, and print-specific styles for bill generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/calculations.ts": "Utility functions for milk collection calculations including VLC and Thekadari amount formulas, less/add adjustments, net milk calculations, and session determination based on time of day.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for displaying currency, dates, times, and less/add values with proper localization and sign prefixes.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML content for transaction history PDFs including farmer details, current balance, and transaction records formatted for printing.",
  "frontend/src/utils/sellBillGenerator.ts": "Generates HTML content for product sale receipts with farmer info, product details, pricing, and signature sections formatted for printing.",
  "frontend/src/utils/smsHelper.ts": "Utility functions to create SMS URIs and open the native SMS app with pre-filled phone number and message content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Poppins), container settings, and animation keyframes for accordions.",
  "project_state.json": "Project state tracking for Anmol Dairy Life sales management system, documenting existing features for printable sell bills with farmer details, product info, and company header."
}