{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add read-only farmer portal page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new route '/farmer-portal/:farmerId' that displays a farmer's bill and transaction history in a read-only format",
      "acceptanceCriteria": [
        "New route is accessible via direct URL with farmer ID parameter",
        "Page displays the farmer's complete transaction history",
        "Page shows the farmer's current bill/balance information",
        "No edit buttons, forms, or interactive controls are present",
        "Navigation to other sections of the app is not available from this page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add new route '/farmer-portal/:farmerId' to the router configuration. This route should render the FarmerPortalView component without the main app navigation chrome, similar to how the PDF route is structured. Ensure the route is registered alongside existing routes."
        },
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "create",
          "description": "Create the main farmer portal view component that displays farmer details, current balance, and transaction history in a read-only format. Fetch farmer data, balance, and transactions using existing hooks (useFarmer, useFarmerBalance, useFarmerTransactions). Layout should be clean and mobile-friendly with no navigation, edit buttons, or interactive controls."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display farmer details (name, customer ID) at the top of the read-only portal page",
      "acceptanceCriteria": [
        "Farmer name is displayed prominently",
        "Customer ID is shown",
        "Information is read-only and cannot be modified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "modify",
          "description": "Add a header section displaying the farmer's name and customer ID prominently at the top of the portal view. Use the Farmer data fetched via useFarmer hook. Style the header to be clear and readable on mobile devices."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show the farmer's current balance prominently on the read-only portal page",
      "acceptanceCriteria": [
        "Current balance is displayed in a clear, prominent format",
        "Balance uses consistent currency formatting",
        "Balance updates reflect all transactions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "modify",
          "description": "Add a balance display section showing the farmer's current balance using the useFarmerBalance hook. Apply currency formatting using the existing formatCurrency utility from frontend/src/utils/formatters.ts. Position the balance prominently below the farmer details header."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display a complete list of all transactions for the farmer in chronological order on the portal page",
      "acceptanceCriteria": [
        "All transactions are listed with date, type, and amount",
        "Transactions are sorted by date (newest first or oldest first)",
        "Transaction details include payment/receipt type and any comments",
        "List supports pagination if there are many transactions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "modify",
          "description": "Add a transaction history section that displays all transactions fetched via useFarmerTransactions hook with pagination support. Show transaction date (formatted using formatDate from formatters.ts), description, and amount for each entry. Display transactions in chronological order. Include simple pagination controls if needed to handle large transaction lists."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure the farmer portal page has no navigation links, edit buttons, add buttons, or delete functionality",
      "acceptanceCriteria": [
        "No edit, add, or delete buttons are present",
        "No navigation menu or links to other app sections",
        "No forms or input fields are available",
        "Page is strictly read-only"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "modify",
          "description": "Ensure the FarmerPortalView component contains only read-only display elements. Do not include any buttons, forms, input fields, navigation menus, or links to other sections. The component should be purely informational with no interactive controls for editing or navigation."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Style the farmer portal page with a clean, print-friendly layout suitable for viewing on mobile devices",
      "acceptanceCriteria": [
        "Layout is responsive and works well on mobile screens",
        "Typography is clear and readable",
        "Page can be printed if needed",
        "Design is simple and focused on information display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/farmer-portal/FarmerPortalView.tsx",
          "operation": "modify",
          "description": "Apply responsive styling using Tailwind CSS classes to ensure the portal view works well on mobile screens. Use clear typography with appropriate text sizes and spacing. Add print-specific styles similar to those in frontend/src/index.css to ensure the page prints cleanly when needed. Keep the design minimal and focused on information display."
        }
      ]
    }
  ]
}