{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add printable sell bill with company header and transaction details",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Generate a printable sell bill when saving a product sale that includes farmer name, product name, price per unit, quantity, total amount, date and time, and company header ('ANMOL DAIRY LIFE')",
      "acceptanceCriteria": [
        "Sell bill displays company header 'ANMOL DAIRY LIFE' at the top",
        "Bill includes farmer name (when a farmer is selected for the sale)",
        "Bill shows product name, price per unit, quantity, and calculated total amount",
        "Bill displays the current date and time of the transaction",
        "Print dialog opens automatically after saving a product sale",
        "Bill format is clean and suitable for printing on standard paper"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/sellBillGenerator.ts",
          "operation": "create",
          "description": "Create utility function to generate HTML content for sell bills with company header 'ANMOL DAIRY LIFE', farmer name (optional), product details (name, price per unit, quantity), calculated total amount, and transaction timestamp. Include print-specific CSS styles similar to pdfGenerator.ts for A4/letter-size paper optimization. Function should accept sale details as parameters and return formatted HTML string."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add print-specific CSS rules for sell bill layout in the @media print section, including styles for company header, transaction details table, and page formatting to ensure clean output on standard paper."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "In SellModule.tsx, trigger the print dialog immediately after successfully saving a product sale to the backend",
      "acceptanceCriteria": [
        "Print dialog appears automatically after the sale is saved",
        "User can proceed with printing or cancel the dialog",
        "The print action does not interfere with the form reset or success feedback"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dairy/SellModule.tsx",
          "operation": "modify",
          "description": "Add print functionality to the handleSubmit success flow: after addProductSale mutation succeeds, generate sell bill HTML using the new sellBillGenerator utility with sale details (selected farmer name if applicable, product name, price per unit, quantity, total amount, current timestamp), inject the HTML into a hidden container, and trigger window.print(). Ensure print dialog opens after the sale is saved but before form reset, and cleanup the injected HTML after printing completes or is cancelled."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create a reusable utility function similar to pdfGenerator.ts that generates HTML content for the sell bill with proper styling for print media",
      "acceptanceCriteria": [
        "Utility function accepts sale details (farmer, product, price, quantity, amount, timestamp) as parameters",
        "Generated HTML includes print-specific CSS styles",
        "Bill layout is optimized for A4 or letter-size paper",
        "Function is located in frontend/src/utils/ directory"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/sellBillGenerator.ts",
          "operation": "create",
          "description": "Create generateSellBillHTML function that accepts parameters (farmerName: string | null, productName: string, pricePerUnit: number, quantity: number, totalAmount: number, timestamp: Date) and returns formatted HTML string. Include inline styles for print media, company header 'ANMOL DAIRY LIFE' prominently at top, transaction details in a clean table format, and proper spacing for A4/letter-size paper. Follow the structure and styling patterns from pdfGenerator.ts but adapted for sell bill layout."
        }
      ]
    }
  ]
}