{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add edit functionality for Cash, Sell, and Milk Collection entries",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add edit functionality to Cash Payment and Cash Received transactions in the CashModule component",
      "acceptanceCriteria": [
        "Each cash transaction row displays an edit button or icon",
        "Clicking edit opens a form pre-populated with the existing transaction data",
        "Users can modify amount, date, and description fields",
        "Saving the edit updates the transaction in the backend",
        "The transaction list refreshes to show the updated entry"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dairy/CashModule.tsx",
          "operation": "modify",
          "description": "Add edit mode state and UI to the CashModule component. For each transaction in the displayed list, add an Edit button/icon. When clicked, populate the existing form fields with the transaction data (amount, date, description) and switch to edit mode. Add logic to call the backend updateTransaction function when saving edits, then invalidate the farmerTransactions query to refresh the list. Use the backend interface method updateTransaction(farmerID, transactionID, description, amount)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useUpdateTransaction that calls actor.updateTransaction with the transaction ID, farmer ID, updated description, and amount. Configure the mutation to invalidate the farmerTransactions query on success to trigger a refresh of the transaction list."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add edit functionality to product sale entries in the SellModule component",
      "acceptanceCriteria": [
        "Each sale entry displays an edit button or icon",
        "Clicking edit opens a form pre-populated with the existing sale data",
        "Users can modify product selection, quantity, price, customer name, and date",
        "Saving the edit updates the sale record in the backend and adjusts inventory accordingly",
        "The sales list refreshes to show the updated entry"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dairy/SellModule.tsx",
          "operation": "modify",
          "description": "Add edit mode state and UI to the SellModule component. Display a list of recent product sales with an Edit button/icon for each entry. When clicked, populate the form fields with the existing sale data (product name, quantity, price per unit, customer/farmer selection, date) and switch to edit mode. Add logic to call the backend updateProductSale function when saving edits, then invalidate the allProductSales query to refresh the list. Use the backend interface method updateProductSale(saleID, farmerID, productName, quantity, pricePerUnit)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useUpdateProductSale that calls actor.updateProductSale with the sale ID, optional farmer ID, product name, quantity, and price per unit. Configure the mutation to invalidate both the allProductSales and allInventory queries on success to reflect updated sales data and inventory adjustments."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add edit functionality to milk collection entries in DataReports, allowing users to modify weight, fat, SNF, and date",
      "acceptanceCriteria": [
        "Each milk collection entry displays an edit button or icon in the data reports view",
        "Clicking edit opens a form pre-populated with the existing collection data",
        "Users can modify weight, fat percentage, SNF value, and date fields",
        "The amount is automatically recalculated based on the updated values",
        "Saving the edit updates the collection entry in the backend",
        "The collection list refreshes to show the updated entry with recalculated totals"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dairy/DataReports.tsx",
          "operation": "modify",
          "description": "Add edit mode state and UI to the DataReports component. For each collection entry row in the table, add an Edit button/icon. When clicked, open a dialog or inline form pre-populated with the collection data (weight, fat, SNF, date, session). Allow users to modify these fields and display the recalculated amount based on the current rates and milk type using the existing calculation utilities. Add logic to call the backend updateCollectionEntry function when saving edits, then invalidate the paginatedCollections query to refresh the list. Use the backend interface method updateCollectionEntry(farmerID, entryID, weight, fat, snf, rate, session, milkType)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useUpdateCollectionEntry that calls actor.updateCollectionEntry with the farmer ID, entry ID, updated weight, fat, SNF, rate, session, and milk type. Configure the mutation to invalidate the paginatedCollections and sessionCollections queries on success to trigger a refresh of the collection lists and recalculated totals."
        }
      ]
    }
  ]
}