{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix empty PDF generation in BillGenerator component",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Debug and fix the BillGenerator component's PDF generation to ensure all farmer details, billing period dates, collection data table rows, and totals are properly populated in the print dialog",
      "acceptanceCriteria": [
        "When 'Generate PDF' button is clicked in BillGenerator, the browser print dialog opens with fully populated bill content",
        "PDF contains farmer name, customer ID, and phone number in the header section",
        "PDF shows billing period 'From' and 'To' dates",
        "PDF displays a table with all collection entries showing Date, Shift, Fat, SNF/CLR, Qty (L), Rate, and Amount columns",
        "PDF includes totals section with Total Quantity, Average Fat, Average Rate, and Net Payable amount",
        "All numeric values display with proper formatting (2 decimal places for decimals, currency format for amounts)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dairy/BillGenerator.tsx",
          "operation": "modify",
          "description": "Fix the PDF generation logic to ensure bill content is fully rendered before triggering the print dialog. Add a hidden printable section with bill-content class that includes farmer details (name, customer ID, phone), billing period dates, collection data table with all columns (Date, Shift, Fat, SNF/CLR, Qty, Rate, Amount), and totals section (Total Quantity, Average Fat, Average Rate, Net Payable). Ensure the printable section is populated with filtered collection data and farmer information before window.print() is called. Add proper timing/rendering delay if needed to allow DOM updates before print dialog opens."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Verify that the print styles in frontend/src/index.css are correctly applied to the bill content when the print dialog is triggered",
      "acceptanceCriteria": [
        "Print preview shows the bill with correct layout matching the reference design",
        "All bill sections are visible in print preview without being hidden or cut off",
        "Navigation elements and UI controls are hidden in print view",
        "Print styles apply proper page breaks and margins"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Review and verify the @media print styles to ensure the .bill-content class and all its child elements are visible and properly styled. Confirm that navigation, buttons, and UI controls are hidden using display: none. Ensure the printable bill section has proper visibility, page breaks, margins, and that table styles are applied correctly. Add or fix any missing print-specific styles for bill header, table rows, and totals section to match the reference design."
        }
      ]
    }
  ]
}